#+TITLE:An introduction to Emacs
#+AUTHOR:Elisabet Sjökvist
 # #+LATEX_CLASS: beamer
#+LATEX_HEADER:\hypersetup{colorlinks= true, urlcolor= blue,linkcolor= none citecolor= red}
*** babel
built in package for incorporating source code:
http://orgmode.org/worg/org-contrib/babel/intro.html#source-code-blocks-babel
#+BEGIN_SRC python :results output :exports both #:exports code :exports results
print("hello world")
#+END_SRC

#+RESULTS:
: hello world

#+name: square
#+header: :var x=0
#+begin_src python :exports none
  return x*x
#+end_src

#+call: square(x=6)

<s - tab: to open a source code block
within the src, type C-c '
this opens up a new window with the appropriate language, to import this back into the document, type C-c ' again.

C-c C-c to evaluate buffer
yehttp://orgmode.org/manual/The-export-dispatcher.html#The-export-dispatcher

http://orgmode.org/worg/org-tutorials/orgtutorial_dto.html

http://orgmode.org/worg/org-tutorials/
- Org + babel

Embedding code:

https://www.youtube.com/watch?v=lsYdK0C2RvQ

Reproducible reserach with org-mode:

https://www.youtube.com/watch?v=1-dUkyn_fZA

